===========
empty-block
===========

{;}

---

(source_file
    (block))

============
simple-block
============

{ 1; 2; 3; }

---

(source_file
    (block
        (int_literal)
        (int_literal)
        (int_literal)))

=================
no-trailing-block
=================

{ 1; 2; 3 }

---

(source_file
    (block
        (int_literal)
        (int_literal)
        (int_literal)))

============
block-nested
============

{ 1; {;}; 2; { 3 }; }

---

(source_file
    (block
        (int_literal)
        (block)
        (int_literal)
        (block 
            (int_literal))))
============
record-empty
============

{}

---

(source_file
    (record))

===============
record-trailing
===============

{,}

---

(source_file
    (record))

==========
record-pun
==========

{ foo }

---

(source_file
    (record (record_pun (identifier))))

===========
record-pair
===========

{ foo: bar }

---

(source_file
    (record (record_pair (identifier) (identifier))))

===================
record-pair-literal
===================

{ 7: bar }

---

(source_file
    (record (record_pair (int_literal) (identifier))))

=============
record-spread
=============

{ foo... };

---

(source_file
    (record
        (spread (identifier))))