=======
if-else
=======

if true { 1 } else { 2 }

---

(source_file
    (conditional
        (TRUE)
        (block (INT))
        (block (INT))))

====
elif
====

if true { 1 } else if false { 2 } else { 3 }

---

(source_file
    (conditional
        (TRUE)
        (block (INT))
        (elif (FALSE) (block (INT)))
        (block (INT))))


=======================
if-else-block-condition
=======================

// weird, but valid!
if { true } { 1 } else { 0 }

---

(source_file
    (conditional
        (block (TRUE))
        (block (INT))
        (block (INT))))


=========
loop-loop
=========

loop { a }

---

(source_file
    (loop
        (block (ID))))

==========
while-loop
==========

while loop { a } { b }

---

(source_file
    (while
        (loop
            (block (ID)))
        (block (ID))))

=====================
return-break-continue
=====================

return break continue 5;

---

(source_file (return (break (continue (INT)))))

============================
return-break-continue-no-arg
============================

return;

---

(source_file (return))