==========
empty-file
==========

---

(source_file)

======================
single-empty-statement
======================

;

---

(source_file)

================
empty-statements
================

;;;

---

(source_file)

===================
multiple-statements
===================

foo;
bar;
baz;

---

(source_file (ID) (ID) (ID))


=====================
no-trailing-semicolon
=====================

foo;
foo

---

(source_file (ID) (ID))

========
comments
========

// a comment!
;;
// more comments in empty statements
;
// trailing comments

----

(source_file)